Ran Plan for dir: `terraform/kubernetes` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.6.3 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/resnostyle/k8s-gitops/1390/default/terraform/kubernetes/default.tfplan\"" in "/home/atlantis/.atlantis/repos/resnostyle/k8s-gitops/1390/default/terraform/kubernetes": exit status 1
data.sops_file.host_secrets: Reading...
data.sops_file.host_secrets: Read complete after 0s [id=-]
data.vault_generic_secret.common_creds: Reading...
data.vault_generic_secret.proxmox_creds: Reading...
data.vault_generic_secret.cloudflare_creds: Reading...
data.vault_generic_secret.common_creds: Read complete after 0s [id=secret/common/user_profile/bryan]
data.vault_generic_secret.proxmox_creds: Read complete after 0s [id=secret/terraform/proxmox]
data.vault_generic_secret.cloudflare_creds: Read complete after 0s [id=secret/terraform/cloudflare]
proxmox_virtual_environment_file.debian_container_template["0"]: Refreshing state... [id=backup-nas:iso/debian-12.2.0-amd64-netinst.iso]
data.cloudflare_zone.bryanwp: Reading...
data.cloudflare_zone.bryanwp: Read complete after 1s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # proxmox_virtual_environment_file.debian_container_template["0"] will be destroyed
  # (because proxmox_virtual_environment_file.debian_container_template is not in configuration)
  - resource "proxmox_virtual_environment_file" "debian_container_template" {
      - content_type           = "iso" -> null
      - datastore_id           = "backup-nas" -> null
      - file_modification_date = "2023-10-07T12:04:58Z" -> null
      - file_name              = "debian-12.2.0-amd64-netinst.iso" -> null
      - file_size              = 658505728 -> null
      - id                     = "backup-nas:iso/debian-12.2.0-amd64-netinst.iso" -> null
      - node_name              = "prox2" -> null
      - overwrite              = true -> null
      - timeout_upload         = 1800 -> null

      - source_file {
          - changed  = false -> null
          - insecure = false -> null
          - path     = "https://cdimage.debian.org/debian-cd/current/amd64/iso-cd/debian-12.2.0-amd64-netinst.iso" -> null
        }
    }

  # proxmox_virtual_environment_file.iso_image["0"] will be created
  + resource "proxmox_virtual_environment_file" "iso_image" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "https://cdimage.debian.org/debian-cd/current/amd64/iso-cd/debian-12.2.0-amd64-netinst.iso"
        }
    }

  # random_password.kube_vm_password will be created
  + resource "random_password" "kube_vm_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # tls_private_key.kube_vm_key will be created
  + resource "tls_private_key" "kube_vm_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + kube_vm_password    = (sensitive value)
  + kube_vm_private_key = (sensitive value)
  + kube_vm_public_key  = (known after apply)
╷
│ Error: Incorrect attribute value type
│ 
│   on proxmox.tf line 25, in resource "proxmox_virtual_environment_vm" "kube_cp":
│   25:     file_id      = proxmox_virtual_environment_file.iso_image["0"]
│     ├────────────────
│     │ proxmox_virtual_environment_file.iso_image["0"] is object with 12 attributes
│ 
│ Inappropriate value for attribute "file_id": string required.
╵
╷
│ Error: Incorrect attribute value type
│ 
│   on proxmox.tf line 25, in resource "proxmox_virtual_environment_vm" "kube_cp":
│   25:     file_id      = proxmox_virtual_environment_file.iso_image["0"]
│     ├────────────────
│     │ proxmox_virtual_environment_file.iso_image["0"] is object with 12 attributes
│ 
│ Inappropriate value for attribute "file_id": string required.
╵
╷
│ Error: Incorrect attribute value type
│ 
│   on proxmox.tf line 25, in resource "proxmox_virtual_environment_vm" "kube_cp":
│   25:     file_id      = proxmox_virtual_environment_file.iso_image["0"]
│     ├────────────────
│     │ proxmox_virtual_environment_file.iso_image["0"] is object with 12 attributes
│ 
│ Inappropriate value for attribute "file_id": string required.
╵
╷
│ Error: Incorrect attribute value type
│ 
│   on proxmox.tf line 42, in resource "proxmox_virtual_environment_vm" "kube_cp":
│   42:     user_data_file_id = proxmox_virtual_environment_file.iso_image["0"]
│     ├────────────────
│     │ proxmox_virtual_environment_file.iso_image["0"] is object with 12 attributes
│ 
│ Inappropriate value for attribute "user_data_file_id": string required.
╵
╷
│ Error: Incorrect attribute value type
│ 
│   on proxmox.tf line 42, in resource "proxmox_virtual_environment_vm" "kube_cp":
│   42:     user_data_file_id = proxmox_virtual_environment_file.iso_image["0"]
│     ├────────────────
│     │ proxmox_virtual_environment_file.iso_image["0"] is object with 12 attributes
│ 
│ Inappropriate value for attribute "user_data_file_id": string required.
╵
╷
│ Error: Incorrect attribute value type
│ 
│   on proxmox.tf line 42, in resource "proxmox_virtual_environment_vm" "kube_cp":
│   42:     user_data_file_id = proxmox_virtual_environment_file.iso_image["0"]
│     ├────────────────
│     │ proxmox_virtual_environment_file.iso_image["0"] is object with 12 attributes
│ 
│ Inappropriate value for attribute "user_data_file_id": string required.
╵

```
</details>